Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/WMP_old/WMP_old.tmx
Source language: en_us
Languages: de_de

source: CLAIMS
de_de: PATENTANSPRÜCHE

source: 1. A method comprising:
de_de: 1. Verfahren, umfassend:

source: receiving, by a base station (105) from an access and mobility management function, AMF, (155) of a core network, a message indicating a start of an overload of the core network, the message comprising a first closed access group identifier, CAG ID;
de_de: Empfangen, durch eine Basisstation (105) von einer Zugangs- und Mobilitätsverwaltungsfunktion, AMF, (155) eines Kernnetzwerks, einer Nachricht, die einen Beginn einer Überlastung des Kernnetzwerks anzeigt, wobei die Nachricht eine erste geschlossene Zugangsgruppen-Kennung, CAG-ID, umfasst;

source: sending, by the base station to a wireless device and based on the overload of the core network, barring information indicating that access via a closed access group associated with the first CAG ID is barred, wherein the sending the barring information to the wireless device comprises broadcasting the barring information in a system information block, SIB; and
de_de: Senden, durch die Basisstation an eine drahtlose Vorrichtung und basierend auf der Überlastung des Kernnetzwerks, von Sperrinformationen, die anzeigen, dass ein Zugang über eine geschlossene Zugangsgruppe, die der ersten CAG-ID zugeordnet ist, gesperrt ist, wobei das Senden der Sperrinformationen an die drahtlose Vorrichtung Broadcasten der Sperrinformationen in einem Systeminformationsblock, SIB, umfasst; und

source: receiving, by the base station from the wireless device, an access request associated with a second closed access group.
de_de: Empfangen einer Zugangsanforderung, die einer zweiten geschlossenen Zugangsgruppe zugeordnet ist, durch die Basisstation von der drahtlosen Vorrichtung.

source: 2. The method of claim 1, wherein the message comprises one or more of:
de_de: 2. Verfahren nach Anspruch 1, wobei die Nachricht eines oder mehrere der Folgenden Elemente umfasst:

source: a public land mobile network identifier; and
de_de: eine Kennung für ein öffentliches Mobilfunknetz; und

source: a non-public network identifier.
de_de: eine Kennung für ein nicht-öffentliches Netzwerk.

source: 3. The method of any of claims 1 to 2, further comprising:
de_de: 3. Verfahren nach einem der Ansprüche 1 bis 2, ferner umfassend:

source: receiving, by the base station from the AMF, a second message indicating a stop of the overload of the core network; and
de_de: Empfangen, durch die Basisstation von der AMF, einer zweiten Nachricht, die ein Ende der Überlastung des Kernnetzwerks anzeigt; und

source: sending, by the base station to the wireless device and based on the stop of the overload of the core network, barring information indicating that the closed access group associated with the first CAG ID is not subject to access barring.
de_de: Senden, durch die Basisstation an die drahtlose Vorrichtung und basierend auf dem Ende der Überlastung des Kernnetzwerks, von Sperrinformationen, die anzeigen, dass die geschlossene Zugangsgruppe, die der ersten CAG-ID zugeordnet ist, keiner Zugangssperre unterliegt.

source: 4. The method of any of claims 1 to 3, wherein the barring information further comprises a time duration indicating that the wireless device is not allowed to access a wireless network for the time duration.
de_de: 4. Verfahren nach einem der Ansprüche 1 bis 3, wobei die Sperrinformationen ferner eine Zeitdauer umfassen, die anzeigt, dass der drahtlosen Vorrichtung der Zugang zu einem drahtloses Netzwerk für die Zeitdauer nicht erteilt wird.

source: 5. A base station comprising:
de_de: 5. Basisstation, umfassend:

source: one or more processors; and
de_de: einen oder mehrere Prozessoren; und

source: memory storing instructions that, when executed by the one or more processors, cause the base station to perform the method of any one of claims 1 to 4.
de_de: einen Speicher, der Anweisungen speichert, die, wenn sie durch den einen oder die mehreren Prozessoren ausgeführt werden, die Basisstation veranlassen, das Verfahren nach einem der Ansprüche 1 bis 4 durchzuführen.

source: 6. A non-transitory computer-readable medium comprising instructions that, when executed by one or more processors, cause the one or more processors to perform the method of any one of claims 1 to 4.
de_de: 6. Nicht-transitorisches computerlesbares Medium, umfassend Anweisungen, die bei Ausführung durch einen oder mehrere Prozessoren den einen oder die mehreren Prozessoren veranlassen, das Verfahren nach einem der Ansprüche 1 bis 4 durchzuführen.

source: 7. A method comprising:
de_de: 7. Verfahren, umfassend:

source: sending, by an access and mobility management function, AMF, (155) of a core network to a base station (105), a message indicating a start of an overload of the core network, the message comprising a first closed access group identifier, CAG ID.
de_de: Senden von einer Zugangs- und Mobilitätsverwaltungsfunktion, AMF, (155) eines Kernnetzwerks an eine Basisstation (105), einer Nachricht, die einen Beginn einer Überlastung des Kernnetzwerks anzeigt, wobei die Nachricht eine erste geschlossene Zugangsgruppen-Kennung, CAG-ID, umfasst.

source: 8. The method of claim 7, wherein the message comprises one or more of:
de_de: 8. Verfahren nach Anspruch 7, wobei die Nachricht eines oder mehrere der Folgenden Elemente umfasst:

source: 9. The method of any of claims 7 to 8, further comprising:
de_de: 9. Verfahren nach einem der Ansprüche 7 bis 8, ferner umfassend:

source: sending, by the AMF to the base station, a second message indicating a stop of the overload of the core network.
de_de: Senden, durch die AMF an die Basisstation, einer zweiten Nachricht, die ein Ende der Überlastung des Kernnetzwerks anzeigt.

source: The method of any of claims 7 to 9, wherein the second message comprises one or more CAG IDs.
de_de: Verfahren nach einem der Ansprüche 7 bis 9, wobei die zweite Nachricht eine oder mehrere CAG-IDs umfasst.

source: The method of any of claims 7 to 10, further comprising receiving, via the base station, a non-access stratum message from a wireless device.
de_de: Verfahren nach einem der Ansprüche 7 bis 10, ferner umfassend ein Empfangen einer Nicht-Zugangsschicht-Nachricht von einer drahtlosen Vorrichtung über die Basisstation.

source: An access and mobility management function, AMF, (155) comprising:
de_de: Zugangs- und Mobilitätsverwaltungsfunktion, AMF, (155), umfassend:

source: memory storing instructions that, when executed by the one or more processors, cause the AMF to perform the method of any one of claims 7 to 11.
de_de: einen Speicher, der Anweisungen speichert, die, wenn sie von dem einen oder den mehreren Prozessoren ausgeführt werden, die AMF veranlassen, das Verfahren nach einem der Ansprüche 7 bis 11 durchzuführen.

source: A non-transitory computer-readable medium comprising instructions that, when executed by one or more processors, cause the one or more processors to perform the method of any one of claims 7 to 11.
de_de: Nichttransitorisches computerlesbares Medium, umfassend Anweisungen, die bei Ausführung durch einen oder mehrere Prozessoren den einen oder die mehreren Prozessoren veranlassen, das Verfahren nach einem der Ansprüche 7 bis 11 durchzuführen.

source: A system comprising:
de_de: System, umfassend:

source: an access and mobility management function, AMF, (155) of a core network, the AMF comprising:
de_de: eine Zugangs- und Mobilitätsverwaltungsfunktion, AMF, (155) eines Kernnetzwerks, die AMF umfassend:

source: one or more first processors; and
de_de: einen oder mehrere erste Prozessoren; und

source: first memory storing first instructions that, when executed by the one or more first processors, cause the AMF to:
de_de: einen ersten Speicher, der erste Anweisungen speichert, die bei Ausführung durch den einen oder die mehreren ersten Prozessoren die AMF zu Folgendem veranlassen:

source: send a message indicating a start of an overload of the core network, the message comprising a first closed access group identifier, CAG ID; and
de_de: eine Nachricht, die einen Beginn einer Überlastung des Kernnetzwerks anzeigt senden, wobei die Nachricht eine erste geschlossene Zugangsgruppen-Kennung, CAG-ID, umfasst; und

source: a base station (105) comprising:
de_de: eine Basisstation (105), umfassend:

source: one or more second processors; and
de_de: einen oder mehrere zweite Prozessoren; und

source: second memory storing second instructions that, when executed by the one or more second processors, cause the base station to:
de_de: einen zweiten Speicher, der zweite Anweisungen speichert, die bei Ausführung durch den einen oder die mehreren zweiten Prozessoren die Basisstation zu Folgendem veranlassen:

source: receive the message indicating the start of the overload of the core network;
de_de: die Nachricht empfangen, die den Beginn der Überlastung des Kernnetzwerks angibt;

source: send, to a wireless device based on the overload of the core network, barring information indicating that access via a closed access group associated with the first CAG ID, wherein the sending the barring information to the wireless device comprises broadcasting the barring information in a system information block, SIB; and
de_de: an eine drahtlose Vorrichtung, basierend auf der Überlastung des Kernnetzwerks, Sperrinformationen senden, die anzeigen, dass ein Zugang über eine geschlossene Zugangsgruppe, die der ersten CAG-ID zugeordnet ist, wobei das Senden der Sperrinformationen an die drahtlose Vorrichtung Broadcasten der Sperrinformationen in einem Systeminformationsblock, SIB, umfasst; und

source: receive, from the wireless device, an access request associated with a second closed access group.
de_de: Empfangen einer Zugangsanforderung, die einer zweiten geschlossenen Zugangsgruppe zugeordnet ist, von der drahtlosen Vorrichtung.

source: receiving, by a base station central unit from a first base station distributed unit, an indication that one or more cells are associated with a first closed access group; the base station central unit being communicatively coupled with an access and mobility management function;
de_de: Empfangen einer Angabe durch eine Basisstation-Zentraleinheit von einer ersten Basisstation-Verteilungseinheit, dass eine oder mehrere Zellen mit einer ersten geschlossenen Zugangsgruppe assoziiert sind; wobei die Basisstation-Zentraleinheit kommunikativ mit einer Zugangs- und Mobilitätsverwaltungsfunktion gekoppelt ist;

source: determining, by the base station central unit and based on the indication, cell configuration parameters of the one or more cells for a wireless device that is allowed to access the first closed access group;
de_de: Bestimmen von Zellkonfigurationsparametern der einen oder der mehreren Zellen für eine drahtlose Vorrichtung, die zugelassen ist, auf die erste geschlossene Zugangsgruppe zuzugreifen, durch die Basisstation-Zentraleinheit und basierend auf der Angabe;

source: sending, by the base station central unit to the first base station distributed unit, a context configuration message comprising the cell configuration parameters;
de_de: Senden einer Kontextkonfigurationsnachricht an die erste Basisstation-Verteilereinheit durch die Basisstation-Zentraleinheit, umfassend die Zellkonfigurationsparameter;

source: receiving, by the base station central unit from a second base station distributed unit, a configuration request message comprising second cell information of one or more second cells of the second base station distributed unit, wherein the second cell information indicates that the second cells are not associated with the first closed access group; and
de_de: Empfangen einer Konfigurationsanforderungsnachricht durch die Basisstation-Zentraleinheit von einer zweiten Basisstation-Verteilungseinheit, umfassend zweite Zellinformationen einer oder mehrerer zweiter Zellen der zweiten Basisstation-Verteilungseinheit, wobei die zweiten Zellinformationen angeben, dass die zweiten Zellen nicht mit der ersten geschlossenen Zugangsgruppe assoziiert sind; und

source: determining, by the base station central unit, based on the second cell information, to not configure the one or more second cells of the second base station distributed unit for the wireless device.
de_de: Bestimmen durch die Basisstation-Zentraleinheit basierend auf den zweiten Zellinformationen, dass die eine oder die mehreren zweiten Zellen der zweiten Basisstation-Verteilungseinheit für die drahtlose Vorrichtung nicht konfiguriert werden.

source: 2. The method of claim 1, wherein the indication is a message comprising one or more parameters of the first base station distributed unit, wherein the one or more parameters indicate that the one or more cells are associated with the first closed access group.
de_de: 2. Verfahren nach Anspruch 1, wobei die Angabe eine Nachricht ist, umfassend einen oder mehrere Parameter der ersten Basisstation-Verteilungseinheit, wobei der eine oder die mehreren Parameter angeben, dass die eine oder die mehreren Zellen mit der ersten geschlossenen Zugangsgruppe assoziiert sind.

source: 3. The method of any of claims 1 to 2, further comprising receiving, by the base station central unit from a second base station, a handover request message for the wireless device indicating that the wireless device is allowed to access the first closed access group, wherein the context configuration message is based on the handover request message.
de_de: 3. Verfahren nach einem der Ansprüche 1 bis 2, ferner umfassend Empfangen einer Übergabeanforderungsnachricht für die drahtlose Vorrichtung durch die Basisstation-Zentraleinheit von einer zweiten Basisstation, die angibt, dass die drahtlose Vorrichtung zugelassen ist, auf die erste geschlossene Zugangsgruppe zuzugreifen, wobei die Kontextkonfigurationsnachricht auf der Übergabeanforderungsnachricht basiert.

source: 4. The method of any of claims 1 to 2, further comprising receiving, by the base station central unit from the wireless device, a radio resource control, RRC, request message for the wireless device indicating that the wireless device is allowed to access the first closed access group, wherein
de_de: 4. Verfahren nach einem der Ansprüche 1 bis 2, ferner umfassend Empfangen einer Funkressourcensteuerungs-(RRC-)Anforderungsnachricht für die drahtlose Vorrichtung durch die Basisstation-Zentraleinheit, die angibt, dass die drahtlose Vorrichtung zugelassen ist, auf die erste geschlossene Zugangsgruppe zuzugreifen, wobei

source: the context configuration message is based on the RRC request message.
de_de: die Kontextkonfigurationsnachricht auf der RRC-Anforderungsnachricht basiert.

source: 5. The method of any of claims 1 to 2, further comprising receiving, by the base station central unit from the access and mobility management function, a wireless device context configuration request message for the wireless device indicating that the wireless device is allowed to access the first closed access group, wherein the context configuration message is based on the wireless device context configuration request message.
de_de: 5. Verfahren nach einem der Ansprüche 1 bis 2, ferner umfassend Empfangen einer Drahtlos-Vorrichtungs-Kontextkonfigurationsanforderungsnachricht für die drahtlose Vorrichtung durch die Basisstation-Zentraleinheit von der Zugangs- und Mobilitätsverwaltungsfunktion, die angibt, dass die drahtlose Vorrichtung zugelassen ist, auf die erste geschlossene Zugangsgruppe zuzugreifen, wobei die Kontextkonfigurationsnachricht auf der Drahtlos-Vorrichtungs-Kontextkonfigurationsanforderungsnachricht basiert.

source: 6. A base station central unit comprising one or more processors and memory storing instructions that, when executed by the one or more processors, cause the base station central unit to perform the method of any one of claims 1 to 5.
de_de: 6. Basisstation-Zentraleinheit, umfassend einen oder mehrere Prozessoren und Speicher, die Anweisungen speichern, die, wenn sie von dem einen oder den mehreren Prozessoren ausgeführt werden, die Basisstation-Zentraleinheit dazu veranlassen, das Verfahren nach einem der Ansprüche 1 bis 5 auszuführen.

source: 7. A non-transitory computer-readable medium comprising instructions that, when executed by one or more processors, cause the one or more processors to perform the method of any one of claims 1 to 5.
de_de: 7. Nichtflüchtiges, computerlesbares Medium, umfassend Anweisungen, die, wenn sie von einem oder mehreren Prozessoren ausgeführt werden, den einen oder die mehreren Prozessoren dazu veranlassen, das Verfahren nach einem der Ansprüche 1 bis 5 auszuführen.

source: 8. A method comprising:
de_de: 8. Verfahren, umfassend:

source: sending, by a first base station distributed unit to a base station central unit, the base station central unit being connected to an access and mobility management function, an indication that one or more cells are associated with a first closed access group;
de_de: Senden einer Angabe, dass eine oder mehrere Zellen mit einer ersten geschlossenen Zugangsgruppe assoziiert sind, durch eine erste Basisstation-Verteilungseinheit an eine Basisstation-Zentraleinheit, wobei die Basisstation-Zentraleinheit mit einer Zugangs- und Mobilitätsverwaltungsfunktion verbunden ist;

source: receiving, by the first base station distributed unit from the base station central unit, a context configuration message comprising cell configuration parameters of the one or more cells;
de_de: Empfangen einer Kontextkonfigurationsnachricht, umfassend Zellkonfigurationsparameter der einen oder der mehreren Zellen, durch die erste Basisstation-Verteilungseinheit von der Basisstation-Zentraleinheit;

source: sending, by a second base station distributed unit to the base station central unit, a configuration request message comprising second cell information of one or more second cells of the second base station distributed unit, wherein the second cell information indicates that the second cells are not associated with the first closed access group; and
de_de: Senden einer Konfigurationsanforderungsnachricht durch eine zweite Basisstation-Verteilungseinheit an die Basisstation-Zentraleinheit, umfassend zweite Zellinformationen einer oder mehrerer zweiter Zellen der zweiten Basisstation-Verteilungseinheit, wobei die zweiten Zellinformationen angeben, dass die zweiten Zellen nicht mit der ersten geschlossenen Zugangsgruppe assoziiert sind; und

source: 9. The method of claim 8, wherein the indication is a message comprising one or more parameters of the first base station distributed unit, wherein the one or more parameters indicate that
de_de: 9. Verfahren nach Anspruch 8, wobei die Angabe eine Nachricht ist, umfassend einen oder mehrere Parameter der ersten Basisstation-Verteilungseinheit, wobei der eine oder die mehreren Parameter angeben, dass

source: the one or more cells are associated with the first closed access group.
de_de: die eine oder die mehreren Zellen mit der ersten geschlossenen Zugangsgruppe verbunden sind.

source: The method of any of claims 8 to 9, wherein the context configuration message is for a wireless device that is allowed to access the first closed access group.
de_de: Verfahren nach einem der Ansprüche 8 bis 9, wobei die Kontextkonfigurationsnachricht für eine drahtlose Vorrichtung ist, die zugelassen ist, auf die erste geschlossenen Zugangsgruppe zuzugreifen.

source: The method of any of claims 9 to 10, wherein the one or more parameters comprise at least one of:
de_de: Verfahren nach einem der Ansprüche 9 bis 10, wobei der eine oder die mehreren Parameter mindestens eines der folgenden Elemente umfassen:

source: a physical cell identifier indicating a cell of the one or more cells; or
de_de: eine physikalische Zellkennung, die eine Zelle der einen oder der mehreren Zellen angibt; oder

source: a parameter indicating whether a non-member of the first closed access group is allowed to access the cell of the one or more cells.
de_de: einen Parameter, der angibt, ob ein Nichtmitglied der ersten geschlossenen Zugangsgruppe zugelassen ist, auf die Zelle der einen oder der mehreren Zellen zuzugreifen.

source: The method of any of claims 8 to 11, further comprising:
de_de: Verfahren nach einem der Ansprüche 8 bis 11, ferner umfassend:

source: receiving, by the first base station distributed unit from the base station central unit, a system information block for at least one of the one or more cells, the system information block comprising an identifier of the first closed access group; and
de_de: Empfangen eines Systeminformationsblocks für mindestens eine der einen oder der mehreren Zellen durch die erste Basisstations-Verteilungseinheit von der Basisstations-Zentraleinheit, der Systeminformationsblock umfassend eine Kennung der ersten geschlossenen Zugangsgruppe; und

source: transmitting, by the first base station distributed unit, the system information block to one or more wireless devices.
de_de: Übertragen des Systeminformationsblocks durch die erste Basisstation-Verteilungseinheit an eine oder mehrere drahtlose Vorrichtungen.

source: A non-transitory computer-readable medium comprising instructions that, when executed by one or more processors, cause the one or more processors to perform the method of any one of claims 8 to 12.
de_de: Nichtflüchtiges, computerlesbares Medium, umfassend Anweisungen, die, wenn sie von einem oder mehreren Prozessoren ausgeführt werden, den einen oder die mehreren Prozessoren dazu veranlassen, das Verfahren nach einem der Ansprüche 8 bis 12 durchzuführen.

source: a base station central unit being communicatively coupled with an access and mobility management function and comprising: one or more processors and memory storing instructions that, when executed by the one or more processors, cause the base station central unit to:
de_de: eine Basisstation-Zentraleinheit, die kommunikativ mit einer Zugangs- und Mobilitätsverwaltungsfunktion gekoppelt ist und Folgendes umfasst: einen oder mehrere Prozessoren und Speicher, die Anweisungen speichern, die, wenn sie von dem einen oder den mehreren Prozessoren ausgeführt werden, die Basisstation-Zentraleinheit zu Folgendem veranlassen:

source: receive, from a first base station distributed unit, an indication that one or more cells are associated with a first closed access group;
de_de: von einer ersten Basisstation-Verteilungseinheit eine Angabe empfangen, dass eine oder mehrere Zellen mit einer ersten geschlossenen Zugangsgruppe assoziiert sind;

source: determine, based on the indication, cell configuration parameters of the one or more cells for a wireless device that is allowed to access the first closed access group;
de_de: basierend auf der Angabe Zellkonfigurationsparameter der einen oder mehreren Zellen für eine drahtlose Vorrichtung bestimmen, die zugelassen ist, auf die erste geschlossene Zugangsgruppe zuzugreifen;

source: send, to the first base station distributed unit, a context configuration message comprising the cell configuration parameters;
de_de: eine Kontextkonfigurationsnachricht an die erste Basisstation-Verteilungseinheit senden, umfassend die Zellkonfigurationsparameter;
